Revit 2026 API

# FailureDefinitionRegistry Properties

---

The FailureDefinitionRegistry type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

#### Reference

FailureDefinitionRegistry Class

Autodesk.Revit.DB Namespace